package algorithm.No1_sort;

/**
 * 排序算法
 *
 * 介绍
 * 排序算法是将一组数据，依指定的顺序进行排列的过程
 *
 * 分类
 * 1. 内部排序法，指将需要处理的所有数据都加载到内部存储器中进行排序。包括
 *     插入排序：直接插入排序*、希尔排序
 *     选择排序：简单选择排序*、堆排序
 *     交换排序：冒泡排序*、快速排序
 *     归并排序
 *     基数排序
 *
 * 2. 外部排序法：数据量过大时，无法全部加载到内存中，需要借助外部存储进行排序。
 *
 * 度量一个程序（算法）执行时间的两种方法
 * 1. 事后统计的方法
 *     这种方法可行，但有两个问题：1）要想对设计的算法的运行性能进行评测，需要实际运行该程序；2）所得的时间的统计量依赖
 * 于计算机的硬件、软件等环境因素。这种方法，要在同一台计算机的相同状态下运行，才能比较哪个算法速度更快。
 * 2. 事前估算的方法
 *     通过分析某个算法的时间复杂度来判断哪个算法更优。
 *
 */
public interface SortAlgorithm {

}
